<?php
	$version = '1.0.4b';


$changelog = '

<h4>1.0.4b</h4>
<p>Вывод контактов и реквизитов на странице Контакты осушествляется из базы данных</p>
<p>Добавление/Удаление контактов в админ. панели</p>

<h4>1.0.3b</h4>
<p>Добавлено отображение должников на главной странице сайта</p>
<p>Новостям добавлен признак важности. Важная новость окрашивается красным и закрепляется на первом месте</p>

<h4>1.0.2b</h4>
<p>Добавлена форма обратной связи на странице Контакты</p>

<h4>1.0.1b</h4>
<p>Добавлен номер версии</p>


';
?>