<?php

	$version = '1.2.4b';

$changelog = '

<h4>1.2.3b</h4>
<p>Исправлено. В панели администратора в разделе пользователи при открытии актов у второго и более пользователей, предыдущие не закрывались</p>
<p>В панели администратора в разделе пользователи добавлен поиск по номеру участка, фамилии или номеру телефона пользователя</p>
<p>В разделе Контакты в форме обратной связи добавлена проверка на робота</p>

<h4>1.2.3b</h4>
<p>В личном кабинете выведены текущие тарифы на энергопотребление</p>
<p>В панели администратора в разделе Пользователи добавлена функция печати и загрузки актов сверки</p>

<h4>1.2.2b</h4>
<p>Исправлено. При просмотре на телефонах и планшетах нижняя информационная панель перекрывала обзор</p>
<p>В панели администратора выведен список должников по всем категориям, а так же общий долг по СНТ</p>
<p>В личном кабинете в разделе энергопотребление акты сверки перенесены во вкладку "Акты сверки", добавлена кнопка печати акта сверки</p>

<h4>1.2.1b</h4>
<p>Добавлена возможность обсуждения новостей, если у новости есть признак "Обсуждение", то для авторизованных пользователей есть возможность читать и добавлять комментраии к ней</p>

<h4>1.1.2b</h4>
<p>В админ панель добавлен раздел Новости, возможность добавлять, редактировать и удалять новости</p>

<h4>1.1.1b</h4>
<p>Исправлена работа с несколькими тарифами</p>
<p>При добавлении пользователя выбирается количество тарифов счетчика и вводятся начальные показания по каждому тарифу</p>
<p>При редактировании пользователя выводятся все тарифы пользователя, + редактирование начальных показаний если они равны нулю</p>
<p>При замене счетчика так же как при добавлении пользователя выбирается количество тарифов счетчика</p>

<h4>1.0.5b</h4>
<p>В админ. панели при редактировании пользователя, если начальные показания = 0, то можно редактировать</p>
<p>Исправлено. При внесении показаний не учитывались начальные показания счетчика</p>
<p>Добавлена возможность редактирования контактов в админ. панели</p>
<p>В админюпанели при добавлении пользователя добавлены подсказки в поле ФИО</p>

<h4>1.0.4b</h4>
<p>Вывод контактов и реквизитов на странице Контакты осушествляется из базы данных</p>
<p>Добавление/Удаление контактов в админ. панели</p>

<h4>1.0.3b</h4>
<p>Добавлено отображение должников на главной странице сайта</p>
<p>Новостям добавлен признак важности. Важная новость окрашивается красным и закрепляется на первом месте</p>

<h4>1.0.2b</h4>
<p>Добавлена форма обратной связи на странице Контакты</p>

<h4>1.0.1b</h4>
<p>Добавлен номер версии</p>


';
?>