<?php

	$version = '1.2.1b';

$changelog = '

<h4>1.2.1b</h4>
<p>Добавлена возможность обсуждения новостей, если у новости есть признак "Обсуждение", то для авторизованных пользователей есть возможность читать и добавлять комментраии к ней</p>

<h4>1.1.2b</h4>
<p>В админ панель добавлен раздел Новости, возможность добавлять, редактировать и удалять новости</p>

<h4>1.1.1b</h4>
<p>Исправлена работа с несколькими тарифами</p>
<p>При добавлении пользователя выбирается количество тарифов счетчика и вводятся начальные показания по каждому тарифу</p>
<p>При редактировании пользователя выводятся все тарифы пользователя, + редактирование начальных показаний если они равны нулю</p>
<p>При замене счетчика так же как при добавлении пользователя выбирается количество тарифов счетчика</p>

<h4>1.0.5b</h4>
<p>В админ. панели при редактировании пользователя, если начальные показания = 0, то можно редактировать</p>
<p>Исправлено. При внесении показаний не учитывались начальные показания счетчика</p>
<p>Добавлена возможность редактирования контактов в админ. панели</p>
<p>В админюпанели при добавлении пользователя добавлены подсказки в поле ФИО</p>

<h4>1.0.4b</h4>
<p>Вывод контактов и реквизитов на странице Контакты осушествляется из базы данных</p>
<p>Добавление/Удаление контактов в админ. панели</p>

<h4>1.0.3b</h4>
<p>Добавлено отображение должников на главной странице сайта</p>
<p>Новостям добавлен признак важности. Важная новость окрашивается красным и закрепляется на первом месте</p>

<h4>1.0.2b</h4>
<p>Добавлена форма обратной связи на странице Контакты</p>

<h4>1.0.1b</h4>
<p>Добавлен номер версии</p>


';
?>