<?php
	//include_once "db_connect.php";
	include ('../_conf.php');
	include ('../classes/safemysql.class.php');
	$db = new SafeMySQL(array('host' => $db_host,'user' => $db_user, 'pass' => $db_pass, 'db' => $db_name, 'charset' => 'utf8'));

	require_once('../classes/core.class.php');

	$core  = new Core();

	$url = $core->url;
	$form = $core->form;
	$ip = $core->ip;
	$get = $core->setGet();

$profiles_descr = [
	'1.0.0' => 'дата-время записи [timestamp]',
	'1.8.0' => 'Активная энергия к потребителю по сумме фаз и тарифов с момента сброса [Вт ч]',
	'1.8.1' => 'Активная энергия к потребителю по сумме фаз тариф 1 с момента сброса [Вт ч]',
	'1.8.2' => 'Активная энергия к потребителю по сумме фаз тариф 2 с момента сброса [Вт ч]',
	'1.8.3' => 'Активная энергия к потребителю по сумме фаз тариф 3 с момента сброса [Вт ч]',
	'1.8.4' => 'Активная энергия к потребителю по сумме фаз тариф 4 с момента сброса [Вт ч]',
	'2.8.0' => 'Активная энергия от потребителя по сумме фаз и тарифов с момента сброса [Вт ч]',
	'2.8.1' => 'Активная энергия от потребителя по сумме фаз тариф 1 с момента сброса [Вт ч]',
	'2.8.2' => 'Активная энергия от потребителя по сумме фаз тариф 2 с момента сброса [Вт ч]',
	'2.8.3' => 'Активная энергия от потребителя по сумме фаз тариф 3 с момента сброса [Вт ч]',
	'2.8.4' => 'Активная энергия от потребителя по сумме фаз тариф 4 с момента сброса [Вт ч]',
	'3.8.0' => 'Реактивная энергия к потребителю по сумме фаз и тарифов с момента сброса[Варч]',
	'3.8.1' => 'Реактивная энергия к потребителю по сумме фаз тариф 1 с момента сброса [Вар ч]',
	'3.8.2' => 'Реактивная энергия к потребителю по сумме фаз тариф 2 с момента сброса [Вар ч]',
	'3.8.3' => 'Реактивная энергия к потребителю по сумме фаз тариф 3 с момента сброса [Вар ч]',
	'3.8.4' => 'Реактивная энергия к потребителю по сумме фаз тариф 4 с момента сброса [Вар ч]',
	'4.8.0' => 'Реактивная энергия от потребителя по сумме фаз и тариф. с момента сброса[Варч]',
	'4.8.1' => 'Реактивная энергия от потребителя по сумме фаз тариф 1 с момента сброса [Вар ч]',
	'4.8.2' => 'Реактивная энергия от потребителя по сумме фаз тариф 2 с момента сброса [Вар ч]',
	'4.8.3' => 'Реактивная энергия от потребителя по сумме фаз тариф 3 с момента сброса [Вар ч]',
	'4.8.4' => 'Реактивная энергия от потребителя по сумме фаз тариф 4 с момента сброса [Вар ч]',
	'9.8.0' => 'Полная энергия к потребителю по сумме фаз и тарифов с момента сброса [ВА ч]',
	'9.8.1' => 'Полная энергия к потребителю по сумме фаз тариф 1 с момента сброса [ВА ч]',
	'9.8.2' => 'Полная энергия к потребителю по сумме фаз тариф 2 с момента сброса [ВА ч]',
	'9.8.3' => 'Полная энергия к потребителю по сумме фаз тариф 3 с момента сброса [ВА ч]',
	'9.8.4' => 'Полная энергия к потребителю по сумме фаз тариф 4 с момента сброса [ВА ч]',
	'1.6.0' => 'Максимум мощности по сумме фаз за период учета [Вт]',
	'1.7.0' => 'Активная мощность по сумме фаз [Вт]',
	'21.7.0' => 'Активная мощность по фазе А [Вт]',
	'41.7.0' => 'Активная мощность по фазе В [Вт]',
	'61.7.0' => 'Активная мощность по фазе С [Вт]',
	'3.7.0' => 'Реактивная мощность по сумме фаз [Вар]',
	'23.7.0' => 'Реактивная мощность по фазе А [Вар]',
	'43.7.0' => 'Реактивная мощность по фазе В [Вар]',
	'63.7.0' => 'Реактивная мощность по фазе С [Вар]',
	'9.7.0' => 'Полная мощность по сумме фаз [ВА]',
	'29.7.0' => 'Полная мощность по фазе А [ВА]',
	'49.7.0' => 'Полная мощность по фазе В [ВА]',
	'69.7.0' => 'Полная мощность по фазе С [ВА]',
	'11.7.0' => 'Ток по сумме фаз [А]',
	'31.7.0' => 'Ток по фазе А [А]',
	'51.7.0' => 'Ток по фазе В [А]',
	'71.7.0' => 'Ток по фазе С [А]',
	'91.7.0' => 'Ток нейтрали [А]',
	'32.7.0' => 'Напряжение фазы А [В]',
	'52.7.0' => 'Напряжение фазы В [В]',
	'72.7.0' => 'Напряжение фазы С [В]',
	'14.7.0' => 'Частота [Гц]',
	'13.7.0' => 'cosFi суммы фаз',
	'33.7.0' => 'cosFi фазы А',
	'53.7.0' => 'cosFi фазы В',
	'73.7.0' => 'cosFi фазы С',
	'81.7.10' => 'угол между фазами А-В [градусы]',
	'81.7.21' => 'угол между фазами В-С [градусы]',
	'81.7.2' => 'угол между фазами А-С [градусы]'
];

	//авторизация

	if( $curl = curl_init() ) {
		curl_setopt($curl, CURLOPT_URL, 'https://auth.waviot.ru/?action=user-login&true_api=1');
		curl_setopt($curl, CURLOPT_RETURNTRANSFER,true);
		curl_setopt($curl, CURLOPT_SSL_VERIFYHOST, 0);
		curl_setopt($curl, CURLOPT_SSL_VERIFYPEER, 0);
		curl_setopt($curl, CURLOPT_POST, true);
		curl_setopt($curl, CURLOPT_POSTFIELDS, '{"login":"hakalo@bk.ru","password":"0604196911sql11"}' );
		curl_setopt($curl, CURLOPT_HTTPHEADER, array(
    'Content-type: application/json',
    'user-agent: SNT-Dvurech`e',
		'x-requested-with: XMLHttpRequest'
		));

		$out = curl_exec($curl);
		echo "<br>AUTH OUT<br>  \r\n";
		var_dump($out);
		echo "<br> \r\n";
		$str = json_decode($out, TRUE);
		$WAVIOT_JWT = $str['WAVIOT_JWT'];
		var_dump($str);
		echo "<br> \r\n";
	}

	echo '<hr><hr>';



//запрос данных

	//$timefrom = time() - 86400;
	//$timeto = time();
	
	$date = date("d.m.Y", strtotime("yesterday"));
	var_dump($date.' 00:00:00');	
	echo "<br> \r\n";
	var_dump($date.' 23:59:59');	
	echo "<br> \r\n";	
	$timefrom = strtotime($date.' 00:00:00');
	$timeto =   strtotime($date.' 23:59:59');
	

	
	//$modem = '70c3d3'; //47участок
	//$modem = '865BD2'; //25участок	
	//$modem = '864F2A'; //v4
	$modem = '7A69BA'; //error

	if( $curl = curl_init() ) {
		
		$url = 'https://lk.waviot.ru/api.data/get_modem_channel_values/?modem_id='.$modem.'&channel=electro_ac_p_lsum_t1&from='.$timefrom.'&to='.$timeto;
		
		var_dump($url);
		echo "<br> \r\n";
		
		curl_setopt($curl, CURLOPT_URL, $url);		
		curl_setopt($curl, CURLOPT_SSL_VERIFYHOST, 0);
		curl_setopt($curl, CURLOPT_SSL_VERIFYPEER, 0);
		curl_setopt($curl, CURLOPT_RETURNTRANSFER,true);
		curl_setopt($curl, CURLOPT_HTTPHEADER, array(
			'Content-type: application/json',
			'user-agent: SNT-Dvurech`e',
			'x-requested-with: XMLHttpRequest',
			'authorization: bearer '.$WAVIOT_JWT
		));

		$out = curl_exec($curl);
		var_dump(curl_error($curl));
		echo "<br>DATA OUT<br>  \r\n";
		//var_dump($out);
		//echo "<br> \r\n";
		$str = json_decode($out, TRUE);
		echo '<pre>';
		//var_dump($str);
		echo '</pre>';
		echo "<br> \r\n";
		
		foreach ($str["values"] as $key => $value) {
			if ($key > $timefrom && $key < $timeto) {
				echo date("d.m.Y H:m:s", $key).' '.$value;
				echo "<br> \r\n";
			}
			
		}
		


	}

	
